#Part A
library_archive = [
    ("Хоббит", "Дж. Р. Р. Толкин", 1937, 310, "Фэнтези"),
    ("Гордость и предубеждение", "Джейн Остин", 1813, 432, "Роман"),
    ("Марсианин", "Энди Вейер", 2011, 384, "Научная фантастика"),
    ("Убить пересмешника", "Харпер Ли", 1960, 281, "Художественная литература"),
    ("Дюна", "Фрэнк Герберт", 1965, 412, "Научная фантастика"),
    ("Великий Гэтсби", "Фрэнсис Скотт Фицджеральд", 1925, 180, "Художественная литература"),
    ("Левая рука тьмы", "Урсула Ле Гуин", 1969, 304, "Научная фантастика"),
    ("Благие знамения", "Нил Гейман и Терри Пратчетт", 1990, 288, "Фэнтези"),
    ("Над пропастью во ржи", "Джером Д. Сэлинджер", 1951, 234, "Художественная литература"),
    ("Проект 'Феникс'", "Энди Вейер", 2021, 476, "Научная фантастика"),
]

#Part B
crew_members = [
    ("Иванов", "штурман", 5, 4500),
    ("Петрова", "инженер", 8, 5200),
    ("Сидоров", "биолог", 3, 3800),
    ("Козлов", "штурман", 12, 6100),
    ("Орлова", "врач", 6, 4700),
    ("Жуков", "инженер", 15, 7200),
    ("Никитин", "биолог", 7, 4900),
    ("Лебедева", "штурман", 4, 4200),
]

ship_systems = {
    "навигация": ["Иванов", "Козлов", "Лебедева"],
    "двигатели": ["Петрова", "Жуков"],
    "биолаборатория": ["Сидоров", "Никитин"],
    "медицинский_блок": ["Орлова"],
    "энергетика": ["Петрова", "Жуков"],
}
